Revit 2027 API
HVACLoadBuildingType Properties
The HVACLoadBuildingType type exposes the following members.
Properties
Name | Description
AirChangesPerHour |  The air changes per hour.
(Inherited from HVACLoadType)
AreaPerPerson |  The area per person.
(Inherited from HVACLoadType)
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
BuildingTypeName |  The building type name.
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
ClosingTime |  The closing time of the building type.
CoolingSetPoint |  The cooling temperature set point in unit Kelvin (K).
(Inherited from HVACLoadType)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DehumidificationSetPoint |  The dehumidification set point as a number between 0 and 1.
(Inherited from HVACLoadType)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
HeatingSetPoint |  The heating temperature set point in unit Kelvin (K).
(Inherited from HVACLoadType)
HumidificationSetPoint |  The humidification set point as a number between 0 and 1.
(Inherited from HVACLoadType)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LatentHeatGainPerPerson |  The latent heat gain per person.
(Inherited from HVACLoadType)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
LightingLoadDensity |  The lighting load density.
(Inherited from HVACLoadType)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OpeningTime |  The opening time of the building type.
OutdoorAirFlowStandard |  The outdoor airflow standard.
(Inherited from HVACLoadType)
OutdoorAirPerArea |  The outdoor air per area.
(Inherited from HVACLoadType)
OutdoorAirPerPerson |  The outdoor air per person.
(Inherited from HVACLoadType)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
PlenumLighting |  The percentage of plenum lighting contribution.
(Inherited from HVACLoadType)
PowerLoadDensity |  The power load density.
(Inherited from HVACLoadType)
SensibleHeatGainPerPerson |  The sensible heat gain per person.
(Inherited from HVACLoadType)
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
UnoccupiedCoolingSetPoint |  The unoccupied cooling set point of the building type with unit kelvin (K).
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace